-- 1. Выбор всех фильмов на сегодня во всех кинозалах; -----------------------------------------------------------------
SELECT * FROM today_movies;
-- 2. Подсчёт проданных билетов за неделю; -----------------------------------------------------------------------------
SELECT * FROM sold_week_tickets_count;
-- 3. Формирование афиши (фильмы, которые показывают сегодня); <- это реализация 1 пункта. -----------------------------
-- SELECT * FROM today_movies;
-- 4. Поиск 3 самых прибыльных фильмов за неделю; ----------------------------------------------------------------------
SELECT * FROM profitable_movie_of_week LIMIT 3;
-- 5. Сформировать схему зала и показать на ней свободные и занятые места на конкретный сеанс; -------------------------
SELECT s.id, s.places FROM sessions AS s ORDER BY random() LIMIT 1;
-- 6. Вывести диапазон минимальной и максимальной цены за билет на конкретный сеанс. -----------------------------------
SELECT s.id, s.min_ticket_price, s.max_ticket_price FROM sessions AS s ORDER BY random() LIMIT 1;
------------------------------------------------------------------------------------------------------------------------
